In [11]:
import pandas as pd
import os

In [12]:
os.getcwd()

'C:\\Users\\nitis\\Downloads'

In [13]:
os.chdir("C:/Users/nitis/Downloads/")

In [14]:
df=pd.read_csv("Employee_dataset.csv")

In [15]:
df.shape

(18, 7)

In [16]:
df

       Name  Age Gender   Department  Salary Joining_Date  Rating
0     Alice   25      F           HR   50000   2015-04-12     3.2
1       Bob   32      M  Engineering   80000   2012-06-30     4.1
2   Charlie   37      M           HR   52000   2018-07-19     3.8
3     David   45      M  Engineering   87000   2010-08-01     4.5
4       Eve   22      F    Marketing   45000   2019-02-28     3.0
5     Frank   29      M    Marketing   47000   2020-03-15     2.8
6     Grace   41      F           HR   51000   2017-01-10     3.6
7    Hannah   36      F  Engineering   78000   2013-09-25     4.2
8      Ivan   34      M  Engineering   82000   2014-05-18     4.0
9     Julia   28      F           HR   51000   2016-11-01     3.3
10     Karl   39      M    Marketing   46000   2019-08-23     3.1
11    Laura   30      F  Engineering   83000   2011-12-10     4.4
12     Mike   42      M           HR   52000   2015-01-05     3.7
13     Nina   27      F    Marketing   47000   2021-04-18     2.9
14    Oscar   33      M           HR   50000   2018-06-14     3.4
15     Paul   38      M  Engineering   86000   2010-03-22     4.6
16    Queen   29      F    Marketing   48000   2022-07-07     2.7
17     Rick   40      M           HR   54000   2013-10-10     3.5

## 1: find the average salary department-wise

In [22]:
df.groupby('Department')['Salary'].mean()

Department
Engineering    82666.666667
HR             51428.571429
Marketing      46600.000000
Name: Salary, dtype: float64

## 2: Which employee has the highest rating

In [39]:
df['Rating'].idxmax()
df.loc[15]

Name                   Paul
Age                      38
Gender                    M
Department      Engineering
Salary                86000
Joining_Date     2010-03-22
Rating                  4.6
Name: 15, dtype: object

## 3:Get all employees who joined before 2015.

In [45]:
df[df['Joining_Date'] < '2015-01-01']

      Name  Age Gender   Department  Salary Joining_Date  Rating
1      Bob   32      M  Engineering   80000   2012-06-30     4.1
3    David   45      M  Engineering   87000   2010-08-01     4.5
7   Hannah   36      F  Engineering   78000   2013-09-25     4.2
8     Ivan   34      M  Engineering   82000   2014-05-18     4.0
11   Laura   30      F  Engineering   83000   2011-12-10     4.4
15    Paul   38      M  Engineering   86000   2010-03-22     4.6
17    Rick   40      M           HR   54000   2013-10-10     3.5

## 4:How many males and females are there in each department?

In [52]:
pd.crosstab(df['Department'],df['Gender'])

Gender       F  M
Department
Engineering  2  4
HR           3  4
Marketing    3  2

## 5: Calculate the age of each employee in days since they joined.

## 6:Create a new column with salary in thousands.

In [54]:
df['New_Salary']=df['Salary']*1000

In [55]:
df

       Name  Age Gender   Department  Salary Joining_Date  Rating  New_Salary
0     Alice   25      F           HR   50000   2015-04-12     3.2    50000000
1       Bob   32      M  Engineering   80000   2012-06-30     4.1    80000000
2   Charlie   37      M           HR   52000   2018-07-19     3.8    52000000
3     David   45      M  Engineering   87000   2010-08-01     4.5    87000000
4       Eve   22      F    Marketing   45000   2019-02-28     3.0    45000000
5     Frank   29      M    Marketing   47000   2020-03-15     2.8    47000000
6     Grace   41      F           HR   51000   2017-01-10     3.6    51000000
7    Hannah   36      F  Engineering   78000   2013-09-25     4.2    78000000
8      Ivan   34      M  Engineering   82000   2014-05-18     4.0    82000000
9     Julia   28      F           HR   51000   2016-11-01     3.3    51000000
10     Karl   39      M    Marketing   46000   2019-08-23     3.1    46000000
11    Laura   30      F  Engineering   83000   2011-12-10     4.4    83000000
12     Mike   42      M           HR   52000   2015-01-05     3.7    52000000
13     Nina   27      F    Marketing   47000   2021-04-18     2.9    47000000
14    Oscar   33      M           HR   50000   2018-06-14     3.4    50000000
15     Paul   38      M  Engineering   86000   2010-03-22     4.6    86000000
16    Queen   29      F    Marketing   48000   2022-07-07     2.7    48000000
17     Rick   40      M           HR   54000   2013-10-10     3.5    54000000

## 7. Find employees with a rating between 3.5 and 4.2.

In [56]:
bet=df['Rating'].between(3.5,4.2)

In [58]:
df[bet]

       Name  Age Gender   Department  Salary Joining_Date  Rating  New_Salary
1       Bob   32      M  Engineering   80000   2012-06-30     4.1    80000000
2   Charlie   37      M           HR   52000   2018-07-19     3.8    52000000
6     Grace   41      F           HR   51000   2017-01-10     3.6    51000000
7    Hannah   36      F  Engineering   78000   2013-09-25     4.2    78000000
8      Ivan   34      M  Engineering   82000   2014-05-18     4.0    82000000
12     Mike   42      M           HR   52000   2015-01-05     3.7    52000000
17     Rick   40      M           HR   54000   2013-10-10     3.5    54000000

## 8: Rank employees within each department by salary

## 9:Rank employees within each department by salary

## 10:What is the median age by gender

In [62]:
df.groupby('Gender')['Age'].median()

Gender
F    28.5
M    37.5
Name: Age, dtype: float64

## 11: Which department has the highest average rating?

In [67]:
df.groupby('Department')['Rating'].mean().sort_values(ascending=False).head(1)

Department
Engineering    4.3
Name: Rating, dtype: float64

## 12: Get the top 3 earners in the Marketing department.

In [78]:
df[df['Department']=='Marketing']['Salary'].sort_values(ascending=False)

16    48000
13    47000
5     47000
10    46000
4     45000
Name: Salary, dtype: int64

In [81]:
df.iloc[16]

Name                 Queen
Age                     29
Gender                   F
Department       Marketing
Salary               48000
Joining_Date    2022-07-07
Rating                 2.7
New_Salary        48000000
Name: 16, dtype: object

In [82]:
df.iloc[13]

Name                  Nina
Age                     27
Gender                   F
Department       Marketing
Salary               47000
Joining_Date    2021-04-18
Rating                 2.9
New_Salary        47000000
Name: 13, dtype: object

In [83]:
df.iloc[5]

Name                 Frank
Age                     29
Gender                   M
Department       Marketing
Salary               47000
Joining_Date    2020-03-15
Rating                 2.8
New_Salary        47000000
Name: 5, dtype: object

In [84]:
#Also:This is Easiest

In [90]:
df[df['Department']=='Marketing'].nlargest(3,'Salary')

     Name  Age Gender Department  Salary Joining_Date  Rating  New_Salary
16  Queen   29      F  Marketing   48000   2022-07-07     2.7    48000000
5   Frank   29      M  Marketing   47000   2020-03-15     2.8    47000000
13   Nina   27      F  Marketing   47000   2021-04-18     2.9    47000000

## 13:Which employee has the longest tenure (earliest joining date)

In [93]:
df['Joining_Date'].sort_values(ascending=True)

15    2010-03-22
3     2010-08-01
11    2011-12-10
1     2012-06-30
7     2013-09-25
17    2013-10-10
8     2014-05-18
12    2015-01-05
0     2015-04-12
9     2016-11-01
6     2017-01-10
14    2018-06-14
2     2018-07-19
4     2019-02-28
10    2019-08-23
5     2020-03-15
13    2021-04-18
16    2022-07-07
Name: Joining_Date, dtype: object

In [94]:
df.iloc[15]

Name                   Paul
Age                      38
Gender                    M
Department      Engineering
Salary                86000
Joining_Date     2010-03-22
Rating                  4.6
New_Salary         86000000
Name: 15, dtype: object

In [95]:
#Also

In [99]:
df.iloc[df['Joining_Date'].idxmin()]

Name                   Paul
Age                      38
Gender                    M
Department      Engineering
Salary                86000
Joining_Date     2010-03-22
Rating                  4.6
New_Salary         86000000
Name: 15, dtype: object

## 14:Count of employees who have rating less than 3 and salary more than 50000.

In [103]:
df[(df['Rating'] < 3) & (df['Salary'] > 50000)].shape[0]

0

## 15:Get a pivot table showing average salary by department and gender.

In [104]:
pivot_table = pd.pivot_table(df, values='Salary', index='Department', columns='Gender', aggfunc='mean')

In [105]:
pivot_table

Gender                  F        M
Department
Engineering  80500.000000  83750.0
HR           50666.666667  52000.0
Marketing    46666.666667  46500.0

## 16 Find all duplicate entries by Name.

In [107]:
df['Name'].value_counts()

Name
Alice      1
Bob        1
Charlie    1
David      1
Eve        1
Frank      1
Grace      1
Hannah     1
Ivan       1
Julia      1
Karl       1
Laura      1
Mike       1
Nina       1
Oscar      1
Paul       1
Queen      1
Rick       1
Name: count, dtype: int64

In [108]:
df[df.duplicated('Name', keep=False)]

Empty DataFrame
Columns: [Name, Age, Gender, Department, Salary, Joining_Date, Rating, New_Salary]
Index: []

## 17: Remove rows where rating is below 3 and salary is below 50000.

In [117]:
df_filtered = df[~((df['Rating'] < 3) & (df['Salary'] < 50000))]

In [118]:
df_filtered

       Name  Age Gender   Department  Salary Joining_Date  Rating  New_Salary
0     Alice   25      F           HR   50000   2015-04-12     3.2    50000000
1       Bob   32      M  Engineering   80000   2012-06-30     4.1    80000000
2   Charlie   37      M           HR   52000   2018-07-19     3.8    52000000
3     David   45      M  Engineering   87000   2010-08-01     4.5    87000000
4       Eve   22      F    Marketing   45000   2019-02-28     3.0    45000000
6     Grace   41      F           HR   51000   2017-01-10     3.6    51000000
7    Hannah   36      F  Engineering   78000   2013-09-25     4.2    78000000
8      Ivan   34      M  Engineering   82000   2014-05-18     4.0    82000000
9     Julia   28      F           HR   51000   2016-11-01     3.3    51000000
10     Karl   39      M    Marketing   46000   2019-08-23     3.1    46000000
11    Laura   30      F  Engineering   83000   2011-12-10     4.4    83000000
12     Mike   42      M           HR   52000   2015-01-05     3.7    52000000
14    Oscar   33      M           HR   50000   2018-06-14     3.4    50000000
15     Paul   38      M  Engineering   86000   2010-03-22     4.6    86000000
17     Rick   40      M           HR   54000   2013-10-10     3.5    54000000